Conf.Simple/src/Catalogs/SUI_НастройкиДокументовОбмена/SUI_НастройкиДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиДокументовОбмена</name>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетаданныхДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СинонимМетаданныхДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументОбменаПриЗаписиДокумента1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПоУмолчанию</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрупповоеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВДокумент1СПослеОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекОтбораДокументов</name>
    <comment>Настройки компоновки данных содержащие элементы отбора</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекРеквизитовДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПередЗаписью</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеЗаписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиТаблиц</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьНеЗаполненные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеНастроекРеквизитовТаблицы</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмОбработкиСтрокЗагрузкиДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостобработкаЗаполнениеРеквизитов</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостобработкаСозданиеДокументовНаОсновании</name>
    <attributes>
      <name>ИмяДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеПриЗаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмОбработчик</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиИдентификацииСтрок</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/Enums/SUI_ТипыТаблицДокументовОбмена/SUI_ТипыТаблицДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТипыТаблицДокументовОбмена</name>
  <enumValues>
    <name>Отбор</name>
  </enumValues>
  <enumValues>
    <name>Размещение</name>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>ПотокШтрихкодов</name>
  </enumValues>
  <enumValues>
    <name>Серии</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Catalogs/SUI_НастройкиДокументовОбмена/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ЗаполнятьНаименованиеАвтоматически;

&НаКлиенте
Перем ПредыдущийДокумент1С;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьСписокВыбораДокументов1С();
	
	Если Не Объект.Ссылка.Пустая() Тогда
		СсылкаПолученияДанныхХранилища = Объект.Ссылка;
		Документ1С = Объект.ИмяМетаданныхДокумента;
	ИначеЕсли ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		СсылкаПолученияДанныхХранилища = Параметры.ЗначениеКопирования;
		Документ1С = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаПолученияДанныхХранилища, "ИмяМетаданныхДокумента");
	Иначе
		СсылкаПолученияДанныхХранилища = Неопределено;
	КонецЕсли;
	
	Если СсылкаПолученияДанныхХранилища <> Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	&ПустойУникальныйИдентификатор КАК КлючСвязи,
			|	SUI_НастройкиДокументовОбмена.ХранилищеНастроекОтбораДокументов,
			|	SUI_НастройкиДокументовОбмена.ХранилищеНастроекРеквизитовДокумента
			|ИЗ
			|	Справочник.SUI_НастройкиДокументовОбмена КАК SUI_НастройкиДокументовОбмена
			|ГДЕ
			|	SUI_НастройкиДокументовОбмена.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	SUI_НастройкиДокументовОбменаНастройкиТаблиц.КлючСвязи,
			|	SUI_НастройкиДокументовОбменаНастройкиТаблиц.ХранилищеНастроекРеквизитовТаблицы
			|ИЗ
			|	Справочник.SUI_НастройкиДокументовОбмена.НастройкиТаблиц КАК SUI_НастройкиДокументовОбменаНастройкиТаблиц
			|ГДЕ
			|	SUI_НастройкиДокументовОбменаНастройкиТаблиц.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", СсылкаПолученияДанныхХранилища);
		Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.ПустойУникальныйИдентификатор());
		
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		ОписаниеТипаНастройкиКД = Новый ОписаниеТипов("НастройкиКомпоновкиДанных");
		
		Если Не РезультатыЗапроса[0].Пустой() Тогда
			
			Выборка = РезультатыЗапроса[0].Выбрать();
			Выборка.Следующий();
			
			НастройкиОтбораДокументов = Выборка.ХранилищеНастроекОтбораДокументов.Получить();
			Если НастройкиОтбораДокументов <> Неопределено Тогда
				АдресНастроекОтбораДокументов = ПоместитьВоВременноеХранилище(
					ОписаниеТипаНастройкиКД.ПривестиЗначение(НастройкиОтбораДокументов), 
					УникальныйИдентификатор);
			КонецЕсли;
			
			НастройкаКД = Выборка.ХранилищеНастроекРеквизитовДокумента.Получить();
			
			Если НастройкаКД <> Неопределено Тогда
				
				СтрокаНастройки = НастройкиКомпоновкиНастроекРеквизитов.Добавить();
				СтрокаНастройки.КлючСвязи = Выборка.КлючСвязи;
				СтрокаНастройки.АдресНастройки = ПоместитьВоВременноеХранилище(
					ОписаниеТипаНастройкиКД.ПривестиЗначение(НастройкаКД), 
					УникальныйИдентификатор);
				
			КонецЕсли;
					
		КонецЕсли;
		
		Если Не РезультатыЗапроса[1].Пустой() Тогда
			
			Выборка = РезультатыЗапроса[1].Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				НастройкаКД = Выборка.ХранилищеНастроекРеквизитовТаблицы.Получить();
				
				Если НастройкаКД <> Неопределено Тогда
					
					СтрокаНастройки = НастройкиКомпоновкиНастроекРеквизитов.Добавить();
					СтрокаНастройки.КлючСвязи = Выборка.КлючСвязи;
					СтрокаНастройки.АдресНастройки = ПоместитьВоВременноеХранилище(
						ОписаниеТипаНастройкиКД.ПривестиЗначение(НастройкаКД), 
						УникальныйИдентификатор);
						
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПереопределитьСтандартныеКоманды();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ПустаяСтрока(Документ1С) И Элементы.Документ1С.СписокВыбора.НайтиПоЗначению(Документ1С) = Неопределено Тогда
		Документ1С = "";
	КонецЕсли;
	
	ПредыдущийДокумент1С = Документ1С;
	
	ЗаполнятьНаименованиеАвтоматически = ПустаяСтрока(Объект.Наименование);
	
	ПодключитьОбработчикОжидания("ИнициализироватьОсновнуюСхемуКомпоновкиДанных", 0.1, Истина);
	
	НастройкиОтбораДокументовПриИзменении();
	
	ИнициализироватьСписокВыбораДокументовОснования();
	
	ИзменитьОтображениеЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() И Не ПараметрыЗаписи.Свойство("ПривязатьМобильныеУстройства") Тогда
		
		Отказ = Истина;
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПривязкаМобильныхУстройствПодтверждение", ЭтотОбъект, ПараметрыЗаписи);
		ПоказатьВопрос(ОповещениеОЗавершении, НСтр("ru = 'Привязать мобильные устройства к текущей настройке?'"), РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("АдресНастроекОтбораДокументов", АдресНастроекОтбораДокументов);
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("НастройкиКомпоновкиНастроекРеквизитов", Новый Соответствие());
	
	Для Каждого СтрокаНастройки Из НастройкиКомпоновкиНастроекРеквизитов Цикл
		
		Если СтрокаНастройки.КлючСвязи <> SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.ПустойУникальныйИдентификатор() И
			Объект.НастройкиТаблиц.НайтиСтроки(Новый Структура("КлючСвязи", СтрокаНастройки.КлючСвязи)).Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭтоАдресВременногоХранилища(СтрокаНастройки.АдресНастройки) Тогда
			НастройкиКД = ПолучитьИзВременногоХранилища(СтрокаНастройки.АдресНастройки);
		Иначе
			НастройкиКД = Неопределено;
		КонецЕсли;
		
		ТекущийОбъект.ДополнительныеСвойства.НастройкиКомпоновкиНастроекРеквизитов.Вставить(СтрокаНастройки.КлючСвязи, НастройкиКД);
	
	КонецЦикла;
	
	Если ПараметрыЗаписи.Свойство("ПривязатьМобильныеУстройства") Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ПривязатьМобильныеУстройства", ПараметрыЗаписи.ПривязатьМобильныеУстройства);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписьОбъекта_SUI_НастройкиДокументовОбмена");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Документ1СПриИзменении(Элемент)
	
	Документ1СПриИзмененииНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	ЗаполнятьНаименованиеАвтоматически = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздаватьДокументОбменаПриЗаписиДокумента1СПриИзменении(Элемент)
	
	ИзменитьОтображениеЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиТаблицВыгрузка

&НаКлиенте
Процедура НастройкиТаблицПередНачаломИзменения(Элемент, Отказ)
	
	Если Отказ Или Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	ОткрытиеНастройкиРеквизитов(Элемент.ТекущиеДанные.КлючСвязи, НСтр("ru = 'Настройка реквизитов таблицы'"));
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиТаблицПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;
	
	ОткрытиеНастройкиРеквизитов(, НСтр("ru = 'Настройка реквизитов таблицы'"));
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиТаблицВыгрузкаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.НастройкиТаблицВыгрузкаГиперссылкаНастройкаИдентификацииСтрок Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыОткрытия = Новый Структура();
		ПараметрыОткрытия.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
		ПараметрыОткрытия.Вставить("ИмяМетаданныхДокумента", Объект.ИмяМетаданныхДокумента);
		ПараметрыОткрытия.Вставить("ТипТаблицы", Элемент.ТекущиеДанные.ТипТаблицы);
		ПараметрыОткрытия.Вставить("ИмяТабличнойЧасти", Элемент.ТекущиеДанные.ИмяТабличнойЧасти);
		ПараметрыОткрытия.Вставить("КлючСвязи", Элемент.ТекущиеДанные.КлючСвязи);
		ПараметрыОткрытия.Вставить("РеквизитыИдентификации", Новый СписокЗначений());
		ПараметрыОткрытия.Вставить("Заголовок", НСтр("ru = 'Настройка идентификации строк табличной части'"));
		
		СтрокиИдентификацииСтрок = Объект.НастройкиИдентификацииСтрок.НайтиСтроки(
			Новый Структура("КлючСвязи", Элемент.ТекущиеДанные.КлючСвязи));
			
		Для Каждого СтрокаИдентификацииСтрок Из СтрокиИдентификацииСтрок Цикл
			ПараметрыОткрытия.РеквизитыИдентификации.Добавить(СтрокаИдентификацииСтрок.Реквизит);
		КонецЦикла;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("НастройкаИдентификацииСтрокЗавершение", ЭтотОбъект);
		
		ОткрытьФорму("Справочник.SUI_НастройкиДокументовОбмена.Форма.ФормаНастройкиИдентификацииСтрок", ПараметрыОткрытия,
			ЭтотОбъект, УникальныйИдентификатор, Окно, , ОповещениеОЗавершении);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиТаблицВыгрузкаПослеУдаления(Элемент)
	
	// Перегрузить настройки идентификации строк
	НастройкаИдентификацииСтрокЗавершениеНаСервере(Неопределено, Неопределено);
	
	// Перегрузить настройки заполнения реквизитов постобработки
	НастройкиЗаполненияРеквизитовПостобработкиЗавершениеНаСервере("", Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиТаблицЗагрузка

&НаКлиенте
Процедура НастройкиТаблицЗагрузкаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыГиперссылки = Элемент.ПодчиненныеЭлементы.НастройкиТаблицЗагрузкаГруппаГиперссылки.ПодчиненныеЭлементы;
	
	Если Поле = ЭлементыГиперссылки.НастройкиТаблицЗагрузкаГиперссылкаАлгоритмаОбработкиСтрокЗагрузкиДанных Тогда
		
		ПараметрыОткрытияРедактора = SUI_РедакторКодаКлиент.ПараметрыОткрытия(
			Элемент.ТекущиеДанные.АлгоритмОбработкиСтрокЗагрузкиДанных, 
			SUI_НастройкиДокументовКлиентСервер.ПолучитьПредопределенныйАлгоритм(Объект.ИмяМетаданныхДокумента, "ОбработкаСтрок." + Элемент.ТекущиеДанные.ИмяТабличнойЧасти));
		
		ПараметрыОткрытияРедактора.ЗапретРедактированияПриОткрытии = Истина;
		ПараметрыОткрытияРедактора.Заголовок = НСтр("ru = 'Алгоритм обработки строк табличной части'");
		ПараметрыОткрытияРедактора.Описание = СтрШаблон(
			НСтр("ru = 'Алгоритм обработки строк табличной части %1 документа %2'"), 
			Элемент.ТекущиеДанные.ИмяТабличнойЧасти, Объект.СинонимМетаданныхДокумента);
		
		ДобавитьОписаниеПеременныхАлгоритмаОбработкиСтрокНаСервере(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты,
			Объект.ИмяМетаданныхДокумента, Объект.СинонимМетаданныхДокумента, Элемент.ТекущиеДанные.ИмяТабличнойЧасти, Элемент.ТекущиеДанные.ТипТаблицы);
		
		Контекст = Новый Структура();
		Контекст.Вставить("ИдентификаторВладельца", Элемент.ТекущаяСтрока);
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("АлгоритмОбработкиСтрокЗагрузкиДанныхЗавершениеРедактирования", ЭтотОбъект, Контекст);
		
		SUI_РедакторКодаКлиент.ОткрытьРедактор(ПараметрыОткрытияРедактора, ОповещениеОЗавершении, ЭтотОбъект, Окно);
		
	ИначеЕсли Поле = ЭлементыГиперссылки.НастройкиТаблицГиперссылкаЗаполнениеРеквизитовПостобработки Тогда
		
		ОткрытиеНастройкиЗаполненияРеквизитовПостобработки(Элемент.ТекущиеДанные.КлючСвязи, 
			НСтр("ru = 'Настройка заполнение реквизитов табличной части документа'"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПостобработкаСозданиеДокументовНаОсновании

&НаКлиенте
Процедура ПостобработкаСозданиеДокументовНаОснованииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ПостобработкаСозданиеДокументовНаОснованииГиперссылкаАлгоритмаОбработчика Тогда
		
		ПараметрыОткрытияРедактора = SUI_РедакторКодаКлиент.ПараметрыОткрытия(Элемент.ТекущиеДанные.АлгоритмОбработчик, 
			SUI_НастройкиДокументовКлиентСервер.ПолучитьПредопределенныйАлгоритм(Объект.ИмяМетаданныхДокумента, "СоздатьНаОсновании"));
		ПараметрыОткрытияРедактора.ЗапретРедактированияПриОткрытии = Истина;
		ПараметрыОткрытияРедактора.Заголовок = НСтр("ru = 'Алгоритм заполнения документа основания'");
		ПараметрыОткрытияРедактора.Описание = НСтр("ru = 'Алгоритм заполнения документа основания'");
		
		Контекст = Новый Структура();
		Контекст.Вставить("ИдентификаторВладельца", Элемент.ТекущиеДанные.ПолучитьИдентификатор());
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("АлгоритмЗаполненияДокументаОснованияЗавершениеРедактирования", ЭтотОбъект, Контекст);
		
		SUI_РедакторКодаКлиент.ОткрытьРедактор(ПараметрыОткрытияРедактора, ОповещениеОЗавершении, ЭтотОбъект, Окно);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьНастройкиОтбораДокументов(Команда)
	
	Если ПустаяСтрока(АдресОсновнойСхемыКомпоновкиДанных) Или Не ЭтоАдресВременногоХранилища(АдресОсновнойСхемыКомпоновкиДанных) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не инициализирована основная схема компоновки данных'"));
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОткрытьНастройкиОтбораДокументовЗавершение", ЭтотОбъект);
	
	ПараметрыОткрытияНастройкиОтбора = SUI_КомпоновкаДанныхКлиент.ПараметрыОткрытияНастройкиСхемыКомпоновкиДанных(
		ОповещениеОЗавершении, ЭтотОбъект);
	ПараметрыОткрытияНастройкиОтбора.Уникальность = УникальныйИдентификатор;
	ПараметрыОткрытияНастройкиОтбора.Окно = Окно;
	
	ПараметрыНастройкиОтбора = SUI_КомпоновкаДанныхКлиент.ПараметрыНастройкиСхемыКомпоновкиДанных(
		АдресОсновнойСхемыКомпоновкиДанных, АдресНастроекОтбораДокументов, УникальныйИдентификатор);
	ПараметрыНастройкиОтбора.Заголовок 									= НСтр("ru = 'Настройки отбора документов'");
	ПараметрыНастройкиОтбора.НеРедактироватьСхемуКомпоновкиДанных 		= Истина;
	ПараметрыНастройкиОтбора.НеЗагружатьСхемуКомпоновкиДанныхИзФайла 	= Истина;
	ПараметрыНастройкиОтбора.НеПомещатьНастройкиВСхемуКомпоновкиДанных 	= Истина;
	ПараметрыНастройкиОтбора.НеНастраиватьВыбор 						= Истина;
	ПараметрыНастройкиОтбора.НеНастраиватьПараметры 					= Истина;
	ПараметрыНастройкиОтбора.НеНастраиватьПорядок 						= Истина;
	ПараметрыНастройкиОтбора.НеНастраиватьПользовательскиеПоля 			= Истина;
	
	SUI_КомпоновкаДанныхКлиент.ОткрытьНастройкиКомпоновкиДанных(ПараметрыОткрытияНастройкиОтбора, ПараметрыНастройкиОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиРеквизитовДокумента(Команда)
	
	ОткрытиеНастройкиРеквизитов(
		SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.ПустойУникальныйИдентификатор(),
		НСтр("ru = 'Настройка реквизитов документа'"));
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьАлгоритмПередЗаписью(Команда)
	
	ПараметрыОткрытияРедактора = SUI_РедакторКодаКлиент.ПараметрыОткрытия(Объект.АлгоритмПередЗаписью, 
		SUI_НастройкиДокументовКлиентСервер.ПолучитьПредопределенныйАлгоритм(Объект.ИмяМетаданныхДокумента, "ПередЗаписью"));
	ПараметрыОткрытияРедактора.ЗапретРедактированияПриОткрытии = Истина;
	ПараметрыОткрытияРедактора.Заголовок = НСтр("ru = 'Алгоритм перед записью документа 1С'");
	ПараметрыОткрытияРедактора.Описание = СтрШаблон(НСтр("ru = 'Алгоритм выполняемый перед записью документа %1'"), Объект.СинонимМетаданныхДокумента);
	
	ДобавитьОписаниеПеременныхАлгоритмаПередПослеЗаписиНаСервере(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты,
		Объект.ИмяМетаданныхДокумента, Объект.СинонимМетаданныхДокумента);
	
	Контекст = Новый Структура();
	Контекст.Вставить("ИмяРеквизитаАлгоритма", "АлгоритмПередЗаписью");
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("АлгоритмПередИПослеЗаписиЗавершениеРедактирования", ЭтотОбъект, Контекст);
	
	SUI_РедакторКодаКлиент.ОткрытьРедактор(ПараметрыОткрытияРедактора, ОповещениеОЗавершении, ЭтотОбъект, Окно);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьАлгоритмПослеЗаписи(Команда)
	
	ПараметрыОткрытияРедактора = SUI_РедакторКодаКлиент.ПараметрыОткрытия(Объект.АлгоритмПослеЗаписи, 
		SUI_НастройкиДокументовКлиентСервер.ПолучитьПредопределенныйАлгоритм(Объект.ИмяМетаданныхДокумента, "ПослеЗаписи"));
	ПараметрыОткрытияРедактора.ЗапретРедактированияПриОткрытии = Истина;
	ПараметрыОткрытияРедактора.Заголовок = НСтр("ru = 'Алгоритм после записи документа 1С'");
	ПараметрыОткрытияРедактора.Описание = СтрШаблон(НСтр("ru = 'Алгоритм выполняемый после записи документа %1'"), Объект.СинонимМетаданныхДокумента);
	
	ДобавитьОписаниеПеременныхАлгоритмаПередПослеЗаписиНаСервере(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты,
		Объект.ИмяМетаданныхДокумента, Объект.СинонимМетаданныхДокумента);
	
	Контекст = Новый Структура();
	Контекст.Вставить("ИмяРеквизитаАлгоритма", "АлгоритмПослеЗаписи");
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("АлгоритмПередИПослеЗаписиЗавершениеРедактирования", ЭтотОбъект, Контекст);
	
	SUI_РедакторКодаКлиент.ОткрытьРедактор(ПараметрыОткрытияРедактора, ОповещениеОЗавершении, ЭтотОбъект, Окно);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиЗаполненияРеквизитовДокумента(Команда)
	
	ОткрытиеНастройкиЗаполненияРеквизитовПостобработки(
		SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.ПустойУникальныйИдентификатор(),
		НСтр("ru = 'Настройка заполнение реквизитов документа'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьПереопределяемый(Команда)
	
	ПараметрыЗаписи = Новый Структура();
	ПараметрыЗаписи.Вставить("ЗакрытьПриЗаписи");
	
	ВыполнитьПереопределениеКомандыЗаписатьИЗакрыть(ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПереопределяемый(Команда)
	
	ВыполнитьПереопределениеКомандыЗаписатьИЗакрыть(Новый Структура());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПереопределитьСтандартныеКоманды()
	
	Элементы.ФормаЗаписатьИЗакрыть.ИмяКоманды = "ЗаписатьИЗакрытьПереопределяемый";
	Элементы.ФормаЗаписать.ИмяКоманды = "ЗаписатьПереопределяемый";
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСписокВыбораДокументов1С()
	
	Для Каждого ЭлементСписка Из SUI_НастройкиДокументовПовтИсп.СписокДокументовКонфигурации() Цикл
		Элементы.Документ1С.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Документ1СПриИзмененииНаКлиенте()
	
	ВыбранноеЗначениеИзСписка = Элементы.Документ1С.СписокВыбора.НайтиПоЗначению(Документ1С);
	
	Если ВыбранноеЗначениеИзСписка = Неопределено Тогда
		Объект.ИмяМетаданныхДокумента = "";
		Объект.СинонимМетаданныхДокумента = "";
	Иначе
		
		Объект.ИмяМетаданныхДокумента = ВыбранноеЗначениеИзСписка.Значение;
		Объект.СинонимМетаданныхДокумента = ВыбранноеЗначениеИзСписка.Представление;
		
		Если ЗаполнятьНаименованиеАвтоматически Тогда
			Объект.Наименование = Объект.СинонимМетаданныхДокумента;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Документ1С <> ПредыдущийДокумент1С Тогда
		
		ПодключитьОбработчикОжидания("ИнициализироватьОсновнуюСхемуКомпоновкиДанных", 0.1, Истина);
		
		АдресНастроекОтбораДокументов = "";
		НастройкиОтбораДокументовПриИзменении();
		
		Объект.НастройкиТаблиц.Очистить();
		Объект.ПостобработкаЗаполнениеРеквизитов.Очистить();
		Объект.ПостобработкаСозданиеДокументовНаОсновании.Очистить();
		Объект.НастройкиИдентификацииСтрок.Очистить();
		
		НастройкиКомпоновкиНастроекРеквизитов.Очистить();
		
		ИнициализироватьСписокВыбораДокументовОснования();
		
	КонецЕсли;
	
	ИзменитьОтображениеЭлементовФормы();
	
	ПредыдущийДокумент1С = Документ1С;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьОсновнуюСхемуКомпоновкиДанных() Экспорт
	
	ИнициализироватьОсновнуюСхемуКомпоновкиДанныхНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьОсновнуюСхемуКомпоновкиДанныхНаСервере()
	
	АдресОсновнойСхемыКомпоновкиДанных = Справочники.SUI_НастройкиДокументовОбмена.ПолучитьСхемуКомпоновкиДанных(
		Объект.ИмяМетаданныхДокумента, , , Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиОтбораДокументовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		АдресНастроекОтбораДокументов = Результат;
		НастройкиОтбораДокументовПриИзменении();
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОтбораДокументовПриИзменении() Экспорт
	
	ПредставлениеОтбора = "";
	
	Если Не ПустаяСтрока(АдресНастроекОтбораДокументов) И ЭтоАдресВременногоХранилища(АдресНастроекОтбораДокументов) Тогда
		ПредставлениеОтбора = ПолучитьПредставлениеОтбораДокументовНаСервере(АдресНастроекОтбораДокументов);
	КонецЕсли;
	
	Элементы.ОткрытьНастройкиОтбораДокументов.РасширеннаяПодсказка.Заголовок = ПредставлениеОтбора;
	
	Если ПустаяСтрока(ПредставлениеОтбора) Тогда
		Элементы.ОткрытьНастройкиОтбораДокументов.Заголовок = НСтр("ru = 'отбор не установлен'");
	ИначеЕсли СтрДлина(ПредставлениеОтбора) > 100 Тогда
		Элементы.ОткрытьНастройкиОтбораДокументов.Заголовок = Лев(ПредставлениеОтбора, 97) + "...";
	Иначе
		Элементы.ОткрытьНастройкиОтбораДокументов.Заголовок = Лев(ПредставлениеОтбора, 100);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеОтбораДокументовНаСервере(АдресНастроекОтбора)
	
	ТекстПредставления = "";
	
	Если Не ПустаяСтрока(АдресНастроекОтбора) И ЭтоАдресВременногоХранилища(АдресНастроекОтбора) Тогда
		ОписаниеТипаНастройкиКД = Новый ОписаниеТипов("НастройкиКомпоновкиДанных");
		НастройкиКД = ОписаниеТипаНастройкиКД.ПривестиЗначение(ПолучитьИзВременногоХранилища(АдресНастроекОтбора));
		ТекстПредставления = Строка(НастройкиКД.Отбор);
	КонецЕсли;
	
	Возврат ТекстПредставления;
	
КонецФункции

&НаКлиенте
Процедура ИзменитьОтображениеЭлементовФормы()
	
	Если ПустаяСтрока(Объект.ИмяМетаданныхДокумента) Тогда
		Элементы.ГруппаОткрытьНастройкиОтбораДокументов.Доступность = Ложь;
		Элементы.ГруппаСтраницы.Доступность = Ложь;
	Иначе
		Элементы.ГруппаОткрытьНастройкиОтбораДокументов.Доступность = Истина;
		Элементы.ГруппаСтраницы.Доступность = Истина;
	КонецЕсли;
	
	Элементы.СостояниеПоУмолчанию.Видимость = Объект.СоздаватьДокументОбменаПриЗаписиДокумента1С;
	
КонецПроцедуры

&НаКлиенте
Процедура ПривязкаМобильныхУстройствПодтверждение(Ответ, ПараметрыЗаписи) Экспорт
	
	ПараметрыЗаписи.Вставить("ПривязатьМобильныеУстройства", (Ответ = КодВозвратаДиалога.Да));
	ВыполнитьПереопределениеКомандыЗаписатьИЗакрыть(ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПереопределениеКомандыЗаписатьИЗакрыть(ПараметрыЗаписи)
	    
	Если Записать(ПараметрыЗаписи) И ПараметрыЗаписи.Свойство("ЗакрытьПриЗаписи") Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#Область НастройкиРеквизитов

&НаКлиенте
Процедура ОткрытиеНастройкиРеквизитов(КлючСвязи = Неопределено, Заголовок = "", ПараметрыОткрытия = Неопределено)
	
	Если ПараметрыОткрытия = Неопределено Тогда
		
		ПараметрыОткрытия = ПараметрыОткрытияНастройкиРеквизитов(КлючСвязи);
		ПараметрыОткрытия.Заголовок = Заголовок;
		
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("НастройкаРеквизитовЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.SUI_НастройкиДокументовОбмена.Форма.ФормаНастройкиРеквизитов", ПараметрыОткрытия, 
		ЭтотОбъект, УникальныйИдентификатор, Окно, , ОповещениеОЗавершении);
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыОткрытияНастройкиРеквизитов(КлючСвязи = Неопределено)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("КлючСвязи", ?(КлючСвязи = Неопределено, Новый УникальныйИдентификатор(), КлючСвязи));
	ПараметрыОткрытия.Вставить("ИмяМетаданныхДокумента", Объект.ИмяМетаданныхДокумента);
	ПараметрыОткрытия.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	ПараметрыОткрытия.Вставить("Заголовок", "");
	ПараметрыОткрытия.Вставить("НастроенныеТипыТаблиц", Новый СписокЗначений());
	ПараметрыОткрытия.Вставить("АдресНастройкиРеквизитов", "");
	ПараметрыОткрытия.Вставить("ТипТаблицы");
	ПараметрыОткрытия.Вставить("ИмяТабличнойЧасти", "");
	
	Если ЗначениеЗаполнено(ПараметрыОткрытия.КлючСвязи) Тогда
		
		НастройкаТаблицы = Объект.НастройкиТаблиц.НайтиСтроки(Новый Структура("КлючСвязи", ПараметрыОткрытия.КлючСвязи));
		Если НастройкаТаблицы.Количество() > 0 Тогда
			ПараметрыОткрытия.ТипТаблицы = НастройкаТаблицы[0].ТипТаблицы;
			ПараметрыОткрытия.ИмяТабличнойЧасти = НастройкаТаблицы[0].ИмяТабличнойЧасти;
		КонецЕсли;
		
	КонецЕсли;
	
	НастройкиКД = НастройкиКомпоновкиНастроекРеквизитов.НайтиСтроки(Новый Структура("КлючСвязи", ПараметрыОткрытия.КлючСвязи));
	Если НастройкиКД.Количество() > 0 Тогда
		ПараметрыОткрытия.АдресНастройкиРеквизитов = НастройкиКД[0].АдресНастройки;
	КонецЕсли;
	
	НастроенныеТипыТаблиц = Новый Массив();
	Для Каждого СтрокаНастройкиТаблиц Из Объект.НастройкиТаблиц Цикл
		НастроенныеТипыТаблиц.Добавить(СтрокаНастройкиТаблиц.ТипТаблицы);
	КонецЦикла;
	
	ПараметрыОткрытия.НастроенныеТипыТаблиц.ЗагрузитьЗначения(ОбщегоНазначенияКлиентСервер.СвернутьМассив(НастроенныеТипыТаблиц));
	
	Возврат ПараметрыОткрытия;
	
КонецФункции

&НаКлиенте
Процедура НастройкаРеквизитовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлючСвязи = Результат.КлючСвязи;
	
	// Это таблица
	Если ЗначениеЗаполнено(КлючСвязи) Тогда
		
		НастройкаТаблицыПоКлючуСвязи = Объект.НастройкиТаблиц.НайтиСтроки(Новый Структура("КлючСвязи", КлючСвязи));
		
		Если ЗначениеЗаполнено(НастройкаТаблицыПоКлючуСвязи) Тогда
			
			ТекущийИндекс = НастройкаТаблицыПоКлючуСвязи.ВГраница();
			Пока ТекущийИндекс > 0 Цикл
				Объект.НастройкиТаблиц.Удалить(НастройкаТаблицыПоКлючуСвязи[ТекущийИндекс]);
				ТекущийИндекс = ТекущийИндекс-1;
			КонецЦикла;
			
			НастройкаТаблицыПоКлючуСвязи = НастройкаТаблицыПоКлючуСвязи[ТекущийИндекс];
			
		Иначе
			НастройкаТаблицыПоКлючуСвязи = Объект.НастройкиТаблиц.Добавить();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Результат.ТипТаблицы) И Не ПустаяСтрока(Результат.ИмяТабличнойЧасти) Тогда
			
			НастройкаТаблицыПоКлючуСвязи.КлючСвязи = КлючСвязи;
			НастройкаТаблицыПоКлючуСвязи.ТипТаблицы = Результат.ТипТаблицы;
			НастройкаТаблицыПоКлючуСвязи.ИмяТабличнойЧасти = Результат.ИмяТабличнойЧасти;
			
		Иначе
			Объект.НастройкиТаблиц.Удалить(НастройкаТаблицыПоКлючуСвязи);
			КлючСвязи = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Если КлючСвязи <> Неопределено Тогда
		
		НастройкиКД = НастройкиКомпоновкиНастроекРеквизитов.НайтиСтроки(Новый Структура("КлючСвязи", КлючСвязи));
		
		Если НастройкиКД.Количество() > 0 Тогда
			НастройкиКД = НастройкиКД[0];
		Иначе
			НастройкиКД = НастройкиКомпоновкиНастроекРеквизитов.Добавить();
			НастройкиКД.КлючСвязи = КлючСвязи;
		КонецЕсли;
		
		НастройкиКД.АдресНастройки = Результат.АдресНастройкиРеквизитов;
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиИдентификацииСтрок

&НаКлиенте
Процедура НастройкаИдентификацииСтрокЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаИдентификацииСтрокЗавершениеНаСервере(Результат.РеквизитыИдентификации, Результат.КлючСвязи);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура НастройкаИдентификацииСтрокЗавершениеНаСервере(РеквизитыИдентификацииМассив, КлючСвязи)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаПриемник.КлючСвязи,
		|	ТаблицаПриемник.Реквизит
		|ПОМЕСТИТЬ втТаблицаПриемник
		|ИЗ
		|	&ТаблицаПриемник КАК ТаблицаПриемник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТаблицаПриемник.КлючСвязи,
		|	втТаблицаПриемник.Реквизит
		|ИЗ
		|	втТаблицаПриемник КАК втТаблицаПриемник
		|ГДЕ
		|	&УсловиеПоКлючуСвязиТаблицыИсточник
		|	И втТаблицаПриемник.КлючСвязи В (&КлючиСвязиНастроекТаблиц)";
	
	Запрос.УстановитьПараметр("КлючСвязиТаблицыИсточник", КлючСвязи);
	Запрос.УстановитьПараметр("УсловиеПоКлючуСвязиТаблицыИсточник", Истина);
	Запрос.УстановитьПараметр("ТаблицаПриемник", Объект.НастройкиИдентификацииСтрок.Выгрузить());
	Запрос.УстановитьПараметр("КлючиСвязиНастроекТаблиц", Объект.НастройкиТаблиц.Выгрузить().ВыгрузитьКолонку("КлючСвязи"));
	
	Если ЗначениеЗаполнено(КлючСвязи) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКлючуСвязиТаблицыИсточник", "втТаблицаПриемник.КлючСвязи <> &КлючСвязиТаблицыИсточник");
	КонецЕсли;
	
	Объект.НастройкиИдентификацииСтрок.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Если ЗначениеЗаполнено(РеквизитыИдентификацииМассив) Тогда
		
		Для индекс = 0 По РеквизитыИдентификацииМассив.ВГраница() Цикл
			
			СтрокаНастройкиИдентификацииСтрок = Объект.НастройкиИдентификацииСтрок.Добавить();
			СтрокаНастройкиИдентификацииСтрок.КлючСвязи = КлючСвязи;
			СтрокаНастройкиИдентификацииСтрок.Реквизит = РеквизитыИдентификацииМассив[индекс];
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КонсольПроизвольногоАлгоритма

&НаСервереБезКонтекста
Процедура ДобавитьОписаниеПеременныхАлгоритмаПередПослеЗаписиНаСервере(ПользовательскиеОбъекты, ИмяДокумента, СинонимДокумента)
	
	ОписаниеРеквизитовДокументаОбмена = SUI_НастройкиДокументовПовтИсп.ОписаниеРеквизитовДокумента("SUI_ДокументОбмена");
	
	// Описание переменных: ДокументОбъект
	_ПользовательскийОбъект = SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПользовательскиеОбъекты, 
		"ДокументОбъект", 
		СтрШаблон(НСтр("ru = 'Объект документа %1'"), СинонимДокумента),
		"ДокументОбъект." + ИмяДокумента,
		Тип("ДокументСсылка." + ИмяДокумента));
	
	Для Каждого ОписаниеРеквизита Из ОписаниеРеквизитовДокументаОбмена.Строки.Найти("Реквизиты", "Имя", Ложь).Строки Цикл
		
		SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(_ПользовательскийОбъект, 
			ОписаниеРеквизита.Имя,
			ОписаниеРеквизита.Синоним,
			ОписаниеРеквизита.Представление,
			SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизита.Тип),
			,
			Истина);
		
	КонецЦикла;
	
	Для Каждого ОписаниеРеквизита Из ОписаниеРеквизитовДокументаОбмена.Строки.Найти("ТабличныеЧасти", "Имя", Ложь).Строки Цикл
		
		_СвойствоПользовательскогоОбъекта = SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(_ПользовательскийОбъект, 
			ОписаниеРеквизита.Имя,
			ОписаниеРеквизита.Синоним,
			ОписаниеРеквизита.Представление,
			SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизита.Тип),
			,
			Истина);
		
		Для Каждого ОписаниеРеквизитаТЧ Из ОписаниеРеквизита.Строки Цикл
			
			SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(_СвойствоПользовательскогоОбъекта, 
				ОписаниеРеквизитаТЧ.Имя,
				ОписаниеРеквизитаТЧ.Синоним,
				ОписаниеРеквизитаТЧ.Представление,
				SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизитаТЧ.Тип),
				,
				Истина);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьОписаниеПеременныхАлгоритмаОбработкиСтрокНаСервере(ПользовательскиеОбъекты, ИмяДокумента, СинонимДокумента, ИмяТабличнойЧасти, Таблица)
	
	ОписаниеРеквизитовДокументаОбмена = SUI_НастройкиДокументовПовтИсп.ОписаниеРеквизитовДокумента("SUI_ДокументОбмена");
	ОписаниеРеквизитовДокумента = SUI_НастройкиДокументовПовтИсп.ОписаниеРеквизитовДокумента(ИмяДокумента);
	
	// Описание переменных: ДокументОбмена
	_ПользовательскийОбъект = SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПользовательскиеОбъекты, 
		"ДокументОбмена", 
		НСтр("ru = 'Ссылка документа обмена'"),
		Тип("ДокументСсылка.SUI_ДокументОбмена"),
		Тип("ДокументСсылка.SUI_ДокументОбмена"));
	
	Для Каждого ОписаниеРеквизита Из ОписаниеРеквизитовДокументаОбмена.Строки.Найти("Реквизиты", "Имя", Ложь).Строки Цикл
		
		SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(_ПользовательскийОбъект, 
			ОписаниеРеквизита.Имя,
			ОписаниеРеквизита.Синоним,
			ОписаниеРеквизита.Представление,
			SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизита.Тип),
			,
			Истина);
		
	КонецЦикла;
	
	Для Каждого ОписаниеРеквизита Из ОписаниеРеквизитовДокументаОбмена.Строки.Найти("ТабличныеЧасти", "Имя", Ложь).Строки Цикл
		
		_СвойствоПользовательскогоОбъекта = SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(_ПользовательскийОбъект, 
			ОписаниеРеквизита.Имя,
			ОписаниеРеквизита.Синоним,
			ОписаниеРеквизита.Представление,
			SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизита.Тип),
			,
			Истина);
		
		Для Каждого ОписаниеРеквизитаТЧ Из ОписаниеРеквизита.Строки Цикл
			
			SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(_СвойствоПользовательскогоОбъекта, 
				ОписаниеРеквизитаТЧ.Имя,
				ОписаниеРеквизитаТЧ.Синоним,
				ОписаниеРеквизитаТЧ.Представление,
				SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизитаТЧ.Тип),
				,
				Истина);
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Описание переменных: ДанныеЗаполнения
	_ПользовательскийОбъект = SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПользовательскиеОбъекты, 
		"ДанныеЗаполнения", 
		СтрШаблон(НСтр("ru = 'Данные из документа обмена для заполнения строки табличной части документа %1'"), СинонимДокумента),
		Тип("Структура"));
	
	Если Таблица = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары Тогда
		ОписаниеРеквизитовДанныеЗаполнения = ОписаниеРеквизитовДокументаОбмена.Строки.Найти("ТабличныеЧасти", "Имя", Ложь)
			.Строки.Найти("Товары", "Имя", Ложь);
	ИначеЕсли Таблица = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Тогда
		ОписаниеРеквизитовДанныеЗаполнения = ОписаниеРеквизитовДокументаОбмена.Строки.Найти("ТабличныеЧасти", "Имя", Ложь)
			.Строки.Найти("Отбор", "Имя", Ложь);
	ИначеЕсли Таблица = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Тогда
		ОписаниеРеквизитовДанныеЗаполнения = ОписаниеРеквизитовДокументаОбмена.Строки.Найти("ТабличныеЧасти", "Имя", Ложь)
			.Строки.Найти("Размещение", "Имя", Ложь);
	ИначеЕсли Таблица = Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии Тогда
		ОписаниеРеквизитовДанныеЗаполнения = ОписаниеРеквизитовДокументаОбмена.Строки.Найти("ТабличныеЧасти", "Имя", Ложь)
			.Строки.Найти("Серии", "Имя", Ложь);
	ИначеЕсли Таблица = Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок Тогда
		ОписаниеРеквизитовДанныеЗаполнения = ОписаниеРеквизитовДокументаОбмена.Строки.Найти("ТабличныеЧасти", "Имя", Ложь)
			.Строки.Найти("ШтрихкодыУпаковок", "Имя", Ложь);
	Иначе
		ОписаниеРеквизитовДанныеЗаполнения = Неопределено;
	КонецЕсли;
	
	Если ОписаниеРеквизитовДанныеЗаполнения <> Неопределено Тогда
		
		Для Каждого СтрокаОписаниеРеквизитовДанныеЗаполнения Из ОписаниеРеквизитовДанныеЗаполнения.Строки Цикл
			
			Если СтрокаОписаниеРеквизитовДанныеЗаполнения.Имя <> "НомерСтроки" И
				СтрокаОписаниеРеквизитовДанныеЗаполнения.Имя <> "ИдентификаторСтроки" И
				СтрокаОписаниеРеквизитовДанныеЗаполнения.Имя <> "КлючСвязи" И
				СтрокаОписаниеРеквизитовДанныеЗаполнения.Имя <> "КоличествоПлан" И
				СтрокаОписаниеРеквизитовДанныеЗаполнения.Имя <> "КоличествоФакт" Тогда
				ПредставлениеТипа = "Произвольный";
				ОписаниеРеквизита = СтрокаОписаниеРеквизитовДанныеЗаполнения.Представление + НСтр("ru = ' (восстановленные данные)'");
			Иначе
				ПредставлениеТипа = СтрокаОписаниеРеквизитовДанныеЗаполнения.Тип;
				ОписаниеРеквизита = СтрокаОписаниеРеквизитовДанныеЗаполнения.Представление;
			КонецЕсли;
			
			Если СтрокаОписаниеРеквизитовДанныеЗаполнения.Имя = "НомерСтроки" Тогда
				ОписаниеРеквизита = НСтр("ru = 'Номер строки в табличной части документа обмена'");
			ИначеЕсли СтрокаОписаниеРеквизитовДанныеЗаполнения.Имя = "ИдентификаторСтроки" Тогда
				ОписаниеРеквизита = ОписаниеРеквизита + НСтр("ru = ' (служебный идентификатор строки документа обмена)'");
			ИначеЕсли СтрокаОписаниеРеквизитовДанныеЗаполнения.Имя = "КлючСвязи" Тогда
				ОписаниеРеквизита = ОписаниеРеквизита + НСтр("ru = ' (служебный идентификатор для связи с данными табличной части документа 1С)'");
			КонецЕсли;
			
			SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(_ПользовательскийОбъект, 
				СтрокаОписаниеРеквизитовДанныеЗаполнения.Имя,
				СтрокаОписаниеРеквизитовДанныеЗаполнения.Синоним,
				ОписаниеРеквизита,
				SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ПредставлениеТипа));
			
		КонецЦикла;
		
		SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(_ПользовательскийОбъект, 
			"НомерСтрокиПриемник",
			СтрокаОписаниеРеквизитовДанныеЗаполнения.Синоним,
			СтрШаблон(НСтр("ru = 'Номер строки в табличной части документа %1'"), СинонимДокумента),
			Тип("Число"));
		
	КонецЕсли;
	
	// Описание реквизита: ДокументОбъект
	_ПользовательскийОбъект = SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПользовательскиеОбъекты, 
		"ДокументОбъект", 
		СтрШаблон(НСтр("ru = 'Объект документа %1'"), СинонимДокумента),
		"ДокументОбъект." + ИмяДокумента,
		Тип("ДокументСсылка." + ИмяДокумента));
	
	Для Каждого ОписаниеРеквизита Из ОписаниеРеквизитовДокумента.Строки.Найти("Реквизиты", "Имя", Ложь).Строки Цикл
		
		SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(_ПользовательскийОбъект, 
			ОписаниеРеквизита.Имя,
			ОписаниеРеквизита.Синоним,
			ОписаниеРеквизита.Представление,
			SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизита.Тип),
			,
			Истина);
		
	КонецЦикла;
	
	ОписаниеРеквизитовТекущаяСтрока = Неопределено;
	
	Для Каждого ОписаниеРеквизита Из ОписаниеРеквизитовДокумента.Строки.Найти("ТабличныеЧасти", "Имя", Ложь).Строки Цикл
		
		_СвойствоПользовательскогоОбъекта = SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(_ПользовательскийОбъект, 
			ОписаниеРеквизита.Имя,
			ОписаниеРеквизита.Синоним,
			ОписаниеРеквизита.Представление,
			"ТабличнаяЧасть",
			,
			Истина);
		
		Для Каждого ОписаниеРеквизитаТЧ Из ОписаниеРеквизита.Строки Цикл
			
			SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(_СвойствоПользовательскогоОбъекта, 
				ОписаниеРеквизитаТЧ.Имя,
				ОписаниеРеквизитаТЧ.Синоним,
				ОписаниеРеквизитаТЧ.Представление,
				SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизитаТЧ.Тип),
				,
				Истина);
			
		КонецЦикла;
		
		Если ОписаниеРеквизита.Имя = ИмяТабличнойЧасти Тогда
			ОписаниеРеквизитовТекущаяСтрока = ОписаниеРеквизита.Строки;
		КонецЕсли;
		
	КонецЦикла;
	
	// Описание переменных: ТекущаяСтрока
	_ПользовательскийОбъект = SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПользовательскиеОбъекты, 
		"ТекущаяСтрока", 
		СтрШаблон(НСтр("ru = 'Строка табличной части %1 документа %2'"), ИмяТабличнойЧасти, СинонимДокумента),
		"СтрокаТабличнойЧасти");
	
	Если ОписаниеРеквизитовТекущаяСтрока <> Неопределено Тогда
		
		Для Каждого ОписаниеРеквизитаТекущейСтроки Из ОписаниеРеквизитовТекущаяСтрока Цикл
			
			SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(_ПользовательскийОбъект, 
				ОписаниеРеквизитаТекущейСтроки.Имя,
				ОписаниеРеквизитаТекущейСтроки.Синоним,
				ОписаниеРеквизитаТекущейСтроки.Представление,
				SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизитаТекущейСтроки.Тип),
				SUI_ОбщегоНазначения.ПолучитьПервыйСсылочныеТипВОписанииТипов(ОписаниеРеквизитаТекущейСтроки.Тип));
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Описание переменных: НоваяСтрока
	SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПользовательскиеОбъекты, 
		"НоваяСтрока", 
		СтрШаблон(НСтр("ru = 'Признак новой строки параметра ""ТекущаяСтрока"" в табличной части %1 документа %2'"), ИмяТабличнойЧасти, СинонимДокумента),
		Тип("Булево"));
		
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмОбработкиСтрокЗагрузкиДанныхЗавершениеРедактирования(Алгоритм, Контекст) Экспорт
	
	Если Алгоритм = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеНастройкиТаблицы = Объект.НастройкиТаблиц.НайтиПоИдентификатору(Контекст.ИдентификаторВладельца);
	
	Если ДанныеНастройкиТаблицы <> Неопределено Тогда
		ДанныеНастройкиТаблицы.АлгоритмОбработкиСтрокЗагрузкиДанных = Алгоритм;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмПередИПослеЗаписиЗавершениеРедактирования(Алгоритм, Контекст) Экспорт
	
	Если Алгоритм = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект[Контекст.ИмяРеквизитаАлгоритма] = Алгоритм;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмЗаполненияДокументаОснованияЗавершениеРедактирования(Алгоритм, Контекст) Экспорт
	
	Если Алгоритм = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеНастройкиТаблицы = Объект.ПостобработкаСозданиеДокументовНаОсновании.НайтиПоИдентификатору(Контекст.ИдентификаторВладельца);
	ДанныеНастройкиТаблицы.АлгоритмОбработчик = Алгоритм;
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область Постобработка

#Область ЗаполнениеРеквизитовДокумента

&НаКлиенте
Функция ПараметрыОткрытияНастройкиЗаполненияРеквизитовПостобработки(КлючСвязи = Неопределено)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("КлючСвязи", КлючСвязи);
	ПараметрыОткрытия.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	ПараметрыОткрытия.Вставить("Заголовок", "");
	ПараметрыОткрытия.Вставить("ИмяМетаданныхДокумента", Объект.ИмяМетаданныхДокумента);
	ПараметрыОткрытия.Вставить("ТипТаблицы");
	ПараметрыОткрытия.Вставить("ИмяТабличнойЧасти", "");
	ПараметрыОткрытия.Вставить("АдресНастройкиЗаполненияРеквизитов", "");
	
	Если ПараметрыОткрытия.КлючСвязи = Неопределено Тогда
		ПараметрыОткрытия.КлючСвязи = Новый УникальныйИдентификатор();
	ИначеЕсли ЗначениеЗаполнено(ПараметрыОткрытия.КлючСвязи) Тогда
		
		НастройкаТаблицыПоКлючуСвязи = Объект.НастройкиТаблиц.НайтиСтроки(Новый Структура("КлючСвязи", ПараметрыОткрытия.КлючСвязи));
		Если ЗначениеЗаполнено(НастройкаТаблицыПоКлючуСвязи) Тогда
			ПараметрыОткрытия.ТипТаблицы = НастройкаТаблицыПоКлючуСвязи[0].ТипТаблицы;
			ПараметрыОткрытия.ИмяТабличнойЧасти = НастройкаТаблицыПоКлючуСвязи[0].ИмяТабличнойЧасти;
		КонецЕсли;
		
	КонецЕсли;
	
	ДополнитьПараметрыОткрытияНастройкиЗаполненияРеквизитовПостобработкиНаСервере(ПараметрыОткрытия);
	
	Возврат ПараметрыОткрытия;
	
КонецФункции

&НаСервере
Процедура ДополнитьПараметрыОткрытияНастройкиЗаполненияРеквизитовПостобработкиНаСервере(ПараметрыОткрытия)
	
	НастройкиЗаполненияРеквизитовПоКлючуСвязи = Объект.ПостобработкаЗаполнениеРеквизитов.Выгрузить(
		Новый Структура("КлючСвязи", ПараметрыОткрытия.КлючСвязи));
	
	Если ЗначениеЗаполнено(НастройкиЗаполненияРеквизитовПоКлючуСвязи) Тогда
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("НастройкиЗаполненияРеквизитовПоКлючуСвязи", НастройкиЗаполненияРеквизитовПоКлючуСвязи);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НастройкиЗаполненияРеквизитовПоКлючуСвязи.НомерСтроки,
			|	НастройкиЗаполненияРеквизитовПоКлючуСвязи.Реквизит,
			|	НастройкиЗаполненияРеквизитовПоКлючуСвязи.Значение,
			|	НастройкиЗаполненияРеквизитовПоКлючуСвязи.ПриРасхождении
			|ПОМЕСТИТЬ втНастройкиЗаполненияРеквизитовПоКлючуСвязи
			|ИЗ
			|	&НастройкиЗаполненияРеквизитовПоКлючуСвязи КАК НастройкиЗаполненияРеквизитовПоКлючуСвязи
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втНастройкиЗаполненияРеквизитовПоКлючуСвязи.Реквизит,
			|	втНастройкиЗаполненияРеквизитовПоКлючуСвязи.Значение,
			|	втНастройкиЗаполненияРеквизитовПоКлючуСвязи.ПриРасхождении
			|ИЗ
			|	(ВЫБРАТЬ
			|		втНастройкиЗаполненияРеквизитовПоКлючуСвязи.Реквизит,
			|		МИНИМУМ(втНастройкиЗаполненияРеквизитовПоКлючуСвязи.НомерСтроки) КАК НомерСтроки
			|	ИЗ
			|		втНастройкиЗаполненияРеквизитовПоКлючуСвязи КАК втНастройкиЗаполненияРеквизитовПоКлючуСвязи
			|	СГРУППИРОВАТЬ ПО
			|		втНастройкиЗаполненияРеквизитовПоКлючуСвязи.Реквизит) КАК ВложенныйЗапрос
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втНастройкиЗаполненияРеквизитовПоКлючуСвязи КАК втНастройкиЗаполненияРеквизитовПоКлючуСвязи
			|		ПО ВложенныйЗапрос.Реквизит = втНастройкиЗаполненияРеквизитовПоКлючуСвязи.Реквизит
			|		И ВложенныйЗапрос.НомерСтроки = втНастройкиЗаполненияРеквизитовПоКлючуСвязи.НомерСтроки";
		
		ПараметрыОткрытия.АдресНастройкиЗаполненияРеквизитов = ПоместитьВоВременноеХранилище(
			Запрос.Выполнить().Выгрузить(), УникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытиеНастройкиЗаполненияРеквизитовПостобработки(КлючСвязи = Неопределено, Заголовок = "", ПараметрыОткрытия = Неопределено)
	
	Если ПараметрыОткрытия = Неопределено Тогда
		
		ПараметрыОткрытия = ПараметрыОткрытияНастройкиЗаполненияРеквизитовПостобработки(КлючСвязи);
		ПараметрыОткрытия.Заголовок = Заголовок;
		
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("НастройкиЗаполненияРеквизитовПостобработкиЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.SUI_НастройкиДокументовОбмена.Форма.ФормаНастройкиЗаполненияРеквизитовПостобработки", ПараметрыОткрытия, 
		ЭтотОбъект, УникальныйИдентификатор, Окно, , ОповещениеОЗавершении);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиЗаполненияРеквизитовПостобработкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиЗаполненияРеквизитовПостобработкиЗавершениеНаСервере(Результат.АдресНастройкиЗаполненияРеквизитов, Результат.КлючСвязи);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура НастройкиЗаполненияРеквизитовПостобработкиЗавершениеНаСервере(АдресНастройкиЗаполненияРеквизитов, КлючСвязи)
	
	Если Не ПустаяСтрока(АдресНастройкиЗаполненияРеквизитов) И ЭтоАдресВременногоХранилища(АдресНастройкиЗаполненияРеквизитов) Тогда
		ТаблицаИсточник = ПолучитьИзВременногоХранилища(АдресНастройкиЗаполненияРеквизитов);
	Иначе
		ТаблицаИсточник = Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаИсточник.Реквизит,
		|	ТаблицаИсточник.Значение,
		|	ТаблицаИсточник.ПриРасхождении
		|ПОМЕСТИТЬ втТаблицаИсточник
		|ИЗ
		|	&ТаблицаИсточник КАК ТаблицаИсточник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПриемник.КлючСвязи,
		|	ТаблицаПриемник.Реквизит,
		|	ТаблицаПриемник.Значение,
		|	ТаблицаПриемник.ПриРасхождении
		|ПОМЕСТИТЬ втТаблицаПриемник
		|ИЗ
		|	&ТаблицаПриемник КАК ТаблицаПриемник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&КлючСвязиТаблицыИсточник КАК КлючСвязи,
		|	втТаблицаИсточник.Реквизит,
		|	втТаблицаИсточник.Значение,
		|	втТаблицаИсточник.ПриРасхождении
		|ИЗ
		|	втТаблицаИсточник КАК втТаблицаИсточник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втТаблицаПриемник.КлючСвязи,
		|	втТаблицаПриемник.Реквизит,
		|	втТаблицаПриемник.Значение,
		|	втТаблицаПриемник.ПриРасхождении
		|ИЗ
		|	втТаблицаПриемник КАК втТаблицаПриемник
		|ГДЕ
		|	&УсловиеПоКлючуСвязиТаблицыИсточник
		|	И втТаблицаПриемник.КлючСвязи В (&КлючиСвязиНастроекТаблиц)";
	
	Запрос.УстановитьПараметр("КлючСвязиТаблицыИсточник", КлючСвязи);
	Запрос.УстановитьПараметр("УсловиеПоКлючуСвязиТаблицыИсточник", Истина);
	Запрос.УстановитьПараметр("ТаблицаПриемник", Объект.ПостобработкаЗаполнениеРеквизитов.Выгрузить());
	Запрос.УстановитьПараметр("КлючиСвязиНастроекТаблиц", Объект.НастройкиТаблиц.Выгрузить().ВыгрузитьКолонку("КлючСвязи"));
	
	Если КлючСвязи <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКлючуСвязиТаблицыИсточник", "втТаблицаПриемник.КлючСвязи <> &КлючСвязиТаблицыИсточник");
	КонецЕсли;
	
	Если ТаблицаИсточник = Неопределено Тогда
		Запрос.УстановитьПараметр("ТаблицаИсточник", Запрос.Параметры.ТаблицаПриемник.Скопировать());
		Запрос.Параметры.ТаблицаИсточник.Очистить();
	Иначе
		Запрос.УстановитьПараметр("ТаблицаИсточник", ТаблицаИсточник);
	КонецЕсли;
	
	Объект.ПостобработкаЗаполнениеРеквизитов.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеДокументовНаОсновании

&НаКлиенте
Процедура ИнициализироватьСписокВыбораДокументовОснования()
	
	Элементы.ПостобработкаСозданиеДокументовНаОснованииИмяДокумента.СписокВыбора.Очистить();
	
	Если Не ПустаяСтрока(Объект.ИмяМетаданныхДокумента) Тогда
		ИнициализироватьСписокВыбораДокументовОснованияНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСписокВыбораДокументовОснованияНаСервере()
	
	Для Каждого ОписаниеДокументаОснования Из SUI_НастройкиДокументовПовтИсп.СписокДокументовВводимыхНаОсновании(Объект.ИмяМетаданныхДокумента) Цикл
		Элементы.ПостобработкаСозданиеДокументовНаОснованииИмяДокумента.СписокВыбора.Добавить(
			ОписаниеДокументаОснования.Значение, ОписаниеДокументаОснования.Представление);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти
